balazsgrill/modembed/res/Devices/16c5x/PIC10F220.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="16c5x" edc:desc="" edc:dsid="41270" edc:hasfreeze="false" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC10F220" edc:procid="0xf220" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="11.000" edc:maxvoltage="12.000" edc:minvoltage="10.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="3.000" edc:minvoltage="2.000" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasealgo="1" edc:lvpthresh="0" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="2000" edc:eedata="2000" edc:erase="10000" edc:lvpgm="2000" edc:pgm="3000" edc:userid="2000"/>
    <edc:Latches edc:cfg="1" edc:eedata="1" edc:pgm="1" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="16x5x" edc:name="16x5x">
    <edc:MemTraits edc:hwstackdepth="2">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:CalDataMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x2" edc:wordimpl="0xfff" edc:wordinit="0xfff" edc:wordsafe="0xfff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:NMMRMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="1" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x100" edc:issection="true" edc:regionid="page" edc:sectiondesc="ROM code space" edc:sectionname="PROG"/>
    <edc:CalDataZone edc:beginaddr="0xff" edc:endaddr="0x100" edc:regionid="calmem"/>
    <edc:TestZone edc:beginaddr="0x100" edc:endaddr="0x140" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:issection="true" edc:regionid=".idlocs" edc:sectiondesc="ID locations" edc:sectionname="IDLOCS"/>
    <edc:ConfigFuseSector edc:beginaddr="0xfff" edc:endaddr="0x1000" edc:regionid=".config">
      <edc:DCRDef edc:access="-----------nnnnn" edc:cname="CONFIG" edc:default="0xffff" edc:desc="" edc:impl="0x1f" edc:name="CONFIG" edc:nzwidth="0x10" edc:unimplval="1" edc:unused="0xfe3" edc:useinchecksum="0x1f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="IOSCFS" edc:desc="Internal Oscillator Frequency Select bit" edc:mask="0x1" edc:name="IOSCFS" edc:nzwidth="0x1">
              <edc:AliasList>
                <edc:LegacyAlias edc:cname="IOFSCS"/>
              </edc:AliasList>
              <edc:DCRFieldSemantic edc:cname="8MHZ" edc:desc="8 MHz" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="4MHZ" edc:desc="4 MHz" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCPU" edc:desc="Master Clear Pull-up Enable bit" edc:mask="0x1" edc:name="MCPU" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Pull-up disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Pull-up enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="WDTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code protection bit" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Code protection off" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Code protection on" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x40" edc:checksumalgo="0x20" edc:endaddr="0xff"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="GP3/MCLR Pin Function Select bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="GP3/MCLR pin function is MCLR" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="GP3/MCLR pin function is digital I/O, MCLR internally tied to VDD" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x20">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:bank="0x0" edc:beginaddr="0x0" edc:endaddr="0x9" edc:regionid="sfrs">
        <edc:SFRDef edc:access="--------" edc:cname="INDF" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="false" edc:mclr="--------" edc:name="INDF" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF" edc:desc="" edc:mask="0xff" edc:name="INDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0" edc:desc="" edc:mask="0xff" edc:name="TMR0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PCL" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCL" edc:desc="" edc:mask="0xff" edc:name="PCL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-rrnnn" edc:cname="STATUS" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="false" edc:mclr="q--qquuu" edc:name="STATUS" edc:nzwidth="0x8" edc:por="0--11xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:desc="" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:desc="" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="GPWUF" edc:desc="" edc:mask="0x1" edc:name="GPWUF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrnnnnn" edc:cname="FSR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="111uuuuu" edc:name="FSR" edc:nzwidth="0x8" edc:por="111xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR" edc:desc="" edc:mask="0xff" edc:name="FSR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OSCCAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="OSCCAL" edc:nzwidth="0x8" edc:por="11111110">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FOSC4" edc:desc="" edc:mask="0x1" edc:name="FOSC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL" edc:desc="" edc:mask="0x7f" edc:name="CAL" edc:nzwidth="0x7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CAL0" edc:desc="" edc:mask="0x1" edc:name="CAL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL1" edc:desc="" edc:mask="0x1" edc:name="CAL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL2" edc:desc="" edc:mask="0x1" edc:name="CAL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL3" edc:desc="" edc:mask="0x1" edc:name="CAL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL4" edc:desc="" edc:mask="0x1" edc:name="CAL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL5" edc:desc="" edc:mask="0x1" edc:name="CAL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAL6" edc:desc="" edc:mask="0x1" edc:name="CAL6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rnnn" edc:cname="GPIO" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="GPIO" edc:nzwidth="0x8" edc:por="----xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GP0" edc:desc="" edc:mask="0x1" edc:name="GP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GP1" edc:desc="" edc:mask="0x1" edc:name="GP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GP2" edc:desc="" edc:mask="0x1" edc:name="GP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GP3" edc:desc="" edc:mask="0x1" edc:name="GP3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="GP" edc:desc="" edc:mask="0xff" edc:name="GP" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="ADCON0" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11--1100" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="11--1100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO/nDONE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x3" edc:name="CHS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ANS" edc:desc="" edc:mask="0x3" edc:name="ANS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ANS0" edc:desc="" edc:mask="0x1" edc:name="ANS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANS1" edc:desc="" edc:mask="0x1" edc:name="ANS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="nDONE" edc:desc="" edc:mask="0x1" edc:name="nDONE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRES" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADRES" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADRES" edc:desc="" edc:mask="0xff" edc:name="ADRES" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADRES0" edc:desc="" edc:mask="0x1" edc:name="ADRES0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES1" edc:desc="" edc:mask="0x1" edc:name="ADRES1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES2" edc:desc="" edc:mask="0x1" edc:name="ADRES2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES3" edc:desc="" edc:mask="0x1" edc:name="ADRES3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES4" edc:desc="" edc:mask="0x1" edc:name="ADRES4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES5" edc:desc="" edc:mask="0x1" edc:name="ADRES5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES6" edc:desc="" edc:mask="0x1" edc:name="ADRES6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRES7" edc:desc="" edc:mask="0x1" edc:name="ADRES7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0x0" edc:beginaddr="0x10" edc:endaddr="0x20" edc:regionid="gprs"/>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="qqqqqqqq" edc:name="WREG" edc:nmmrid="0x0" edc:nzwidth="0x8" edc:por="qqqqqqqq">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG" edc:desc="" edc:mask="0xff" edc:name="WREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="STKPTR" edc:desc="" edc:impl="0xff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="STKPTR" edc:nmmrid="0x1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0xff" edc:name="STKPTR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="TRISIO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="TRISIO" edc:nmmrid="0x3" edc:nzwidth="0x8" edc:por="-----111">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISIO0" edc:desc="" edc:mask="0x1" edc:name="TRISIO0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISIO1" edc:desc="" edc:mask="0x1" edc:name="TRISIO1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISIO2" edc:desc="" edc:mask="0x1" edc:name="TRISIO2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPTION_REG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="OPTION_REG" edc:nmmrid="0x5" edc:nzwidth="0x8" edc:por="11111111">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PSA" edc:desc="" edc:mask="0x1" edc:name="PSA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0SE" edc:desc="" edc:mask="0x1" edc:name="T0SE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x1" edc:name="T0CS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nGPPU" edc:desc="" edc:mask="0x1" edc:name="nGPPU" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nGPWU" edc:desc="" edc:mask="0x1" edc:name="nGPWU" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0xa6" edc:endaddr="0xa8" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="GP2"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="FOSC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="GP1"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="GP0"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="GP3"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>